socket-load.yaml
config:
  target: "http://localhost:5000"
  engine: "socketio"
  socketio:
    query: token=Bearer%20eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyTmFtZSI6ItCh0L7QutC-0LvQvtCy0LAg0JLQuNC60YLQvtGA0LjRjyDQktC40LrRgtC-0YDQvtCy0L3QsCIsImlkIjoxLCJpc0FkbWluIjp0cnVlLCJpYXQiOjE1NjIxMjMzMDQsImV4cCI6MTU2MjIwOTcwNH0.f87dCHv6gP2In8aVgUI6gW0EAk1KQF6PuJMcegQ_FSQ&userName=%D0%A1%D0%BE%D0%BA%D0%BE%D0%BB%D0%BE%D0%B2%D0%B0%20%D0%92%D0%B8%D0%BA%D1%82%D0%BE%D1%80%D0%B8%D1%8F%20%D0%92%D0%B8%D0%BA%D1%82%D0%BE%D1%80%D0%BE%D0%B2%D0%BD%D0%B0&userId=1
  phases:
    - duration: 600
      arrivalRate: 5
scenarios:
  - name: "Connect and send a bunch of messages"
    flow:
      - loop:
          - emit:
              channel: "channel-message"
              data:
                {
                  "channelId": 1,
                  "message": "Hello world",
                  "type": "text",
                  "userName": "Соколова Виктория Викторовна",
                  "userId": 1,
                  "avatar": "/uploads/av1.jpg",
                  "createdAt": "2019-07-01T11:52:30.138Z",
                  "files": [],
                }
          - think: 1
        count: 5